# -*- coding: utf-8 -*-
import logging
import re

from openpyxl import load_workbook
from io import BytesIO

from django.core.management.base import BaseCommand
from django.conf import settings

from apps.weld.welder_model import Defectoscopist

logger = logging.getLogger(__name__)

people = (
    ('Туртуев Доржи Цыбикжапович', 1,
     'НОАП-0057-18-4877',
     'от 21.02.2020 Специалист II ур. ВИК, РК, ПВК, МК, ВК (2, 6, 8, 11)'),
    ('Жамсуев Алексей Баирович', 2,
     'НОАП-0057-18-4872',
     'от 21.02.2020 Специалист II ур. ВИК, УК, РК (2,6,8,11)'),
    ('Ваганов Александр Игоревич', 2,
     'НОАП-0057-18-4891',
     '21.02.2020 Специалист II ур. ВИК, УК, РК (2,6,8,11)'),
    ('Болотин Сергей Владимирович', 3,
     'НОАП-0057-18-4884',
     'от 21.02.2020 Специалист II ур. ВИК, УК, РК, ПВК, ПВТ (2,6,8,11)'),
    ('Кривокорытов Андрей Николаевич', 2,
     'НОАП-0057-18-2465',
     'от 06.03.2020 Специалист II ур. ПВК,УК (2,6,8,11) РК, ВИК (6,8,11)'),
    ('Барашкин Алексей Геннадьевич', 2,
     'НОАП-0057-18-5424',
     'от 06.03.2020 Специалист II ур. ВИК, УК, РК (2,6,8,11)'),
    ('Латюк Сергей Владимирович', 2,
     '0048-1962',
     'от 12.07.2018 Специалист II ур. ВИК, РК (1,2,3,6,8,11)'),
     #НОАП-0057-18-5426 от 06.03.2020г Специалист II ур. УК, ПВК (2,6,8,11)
    ('Некрасов Иван Иванович', 2,
     'НОАП-0057-18-5423',
     'от 06.03.2020 Специалист II ур. МК (2,6,8,11)'),
     #НОАП-0048-1961 от 12.07.2018г Специалист II ур. ВИК, УК, ПВК, РК (1,2,3,6,8,11)
    ('Проскоков Никита Владимирович', 2,
     'НОАП-0001-57504',
     'Специалист II ур. ВИК, РК, МК, УК, ПВК (1,2,6,8)'),
    ('Кривокорытов Сергей Николаевич', 2,
     'НОАП-0001-61024',
     'от 12.07.2019 Специалист II ур. ВИК, РК, УК (6,8,11)'),
    ('Туртуев Жамсо Вадимович', 2,
     '0057-18-4876',
     'от 21.02.2020 Специалист II ур. ВИК, РК, УК (2,6,8,11)'),
    ('Даулетгильдиев Рифхат Харисович', 2,
     '0034-47-49777-2019',
     'от 07.11.2019 Специалист II ур. ПВТ (1,3,6,8,11)'),
     #№0010-6899 от 17.01.2020 Специалист II ур. ВИК, РК, УК, ПВК (1,3,6,8,11)
    ('Кадыров Эльмир Шамилевич', 2,
     '0034-47-45787-2019',
     'от 15.07.2019 Специалист II ур. ВИК, РК,  (1,8)'),
    ('Хуснуллин Руслан Терентьевич', 2,
     '0039-11-14853',
     'от 22.02.2019 Специалист II ур. ВИК, РК,  (1,2,3,6,8,11)'),
)

class Command(BaseCommand):
    def handle(self, *args, **options):
        Defectoscopist.objects.all().delete()
        for human in people:
            analog = Defectoscopist.objects.filter(stigma=human[1]).first()
            if not analog:
                Defectoscopist.objects.create(
                    name=human[0],
                    state=human[1],
                    stigma=human[2],
                    notice=human[3],
                )


